In [1]:
import pandas
import os

In [4]:
#Listing titles data
listing_titles = pandas.read_csv("./Data/Listing_Titles.tsv", sep="\t", header=0)

In [5]:
listing_titles.head()

   Record Number                                              Title
0              1  Supreme Nike SB Dunk High By any Means Red US1...
1              2  New Balance 530 Männer und Frauen Laufschuhe m...
2              3                     ♥ MICHAEL KORS Sneaker Gr 39 ♥
3              4             New Balance ML 574 EGO Turnschuhe grün
4              5  Nike air jordan 9 og , space jam , hare , bugs...

In [8]:
#Training data for Tagged_Titles
Train_Tagged_Titles = pandas.read_csv("./Data/Train_Tagged_Titles.csv")

In [9]:
Train_Tagged_Titles.head()

,Record Number,Title,Token,Tag,Unnamed: 4
0,1,Supreme Nike SB Dunk High By any Means Red US1...,Supreme,Modell,NaN
1,1,Supreme Nike SB Dunk High By any Means Red US1...,Nike,Marke,NaN
2,1,Supreme Nike SB Dunk High By any Means Red US1...,SB,Produktlinie,NaN
3,1,Supreme Nike SB Dunk High By any Means Red US1...,Dunk,NaN,NaN
4,1,Supreme Nike SB Dunk High By any Means Red US1...,High,Schuhschaft-Typ,NaN